Repository: QuantumArt/QA.DPC
Catalog: QA.Core.DPC.Resources/ChannelStrings.*.resx
Languages: ru_ru

# Unavailable
source: Publication service is currently unavailable
ru_ru: Cервис публикации временно недоступен

# NotConsolidated
source: Current customer code is not working in consolidation mode
ru_ru: Данный кастомер код не работает в режиме консолидации

# NotificationSenderChanged
source: NotificationSender service settings have been changed
ru_ru: Настройки сервиса NotificationSender изменены

source: update
ru_ru: обновить

# ChannelProviderDesc
source: Defines where channel settings is persisted
ru_ru: Определяет, где задаются настройки каналов

source: Channel provider
ru_ru: Провайдер каналов

# StartTimeDesc
source: NotificationSender service start time
ru_ru: Время, когда был запущен сервис NotificationSender

# StartTime
source: Service start time
ru_ru: Время запуска сервиса

source: Channels
ru_ru: Каналы

source: Channel
ru_ru: Канал

source: Queue
ru_ru: Очередь

source: Enqueue time
ru_ru: Время в очереди

# PublishingTime
source: Publication time
ru_ru: Время публикации

source: Product Id
ru_ru: Id продукта

# PublishingStatus
source: Publication status
ru_ru: Статус публикации

source: Channel status
ru_ru: Статус канала

source: General settings
ru_ru: Общие настройки

# AutoPublicationDesc
source: Defines whether article changes should automatically be sent to fronts
ru_ru: Определяет, будут ли изменения в статьях автоматически попадать на витрины

source: Autopublication
ru_ru: Автопубликация

source: Send interval
ru_ru: Интервал отправки

# SendIntervalDesc
source: Interval between checks for new notifications to be sent
ru_ru: Интервал проверки новых нотификаций для отправки

# ErrorSendInterval
source: Send interval while errors are occuring
ru_ru: Интервал отправки при ошибках

# ErrorSendIntervalDesc
source: Wait interval when new notifications are not sent to current receiver
ru_ru: Интервал ожидания, когда новых уведомлений не отправляется для этого потребителя

# ErrNumBeforeWait
source: Number of errors
ru_ru: Количество ошибок

# ErrNumBeforeWaitDesc
source: Number of errors before waiting interval
ru_ru: Количество ошибок при отправке перед интервалом ожиданияк

source: Package size
ru_ru: Размер пакета сообщений

# PackageSizeDesc
source: Number of simultaneously processed notifications
ru_ru: Количество обрабатываемых сообщений за раз

# NotifyTimeout
source: Notification timeout
ru_ru: Таймаут для отправки нотификаций

# NotifyTimeoutDesc
source: Timeout of sending to front
ru_ru: Таймаут отправки на витрину

source: Important
ru_ru: Важно

source: System settings
ru_ru: Системные настройки

# YourLastTask
source: Task
ru_ru: Задача

source: Status of channel
ru_ru: Статус канала

source: State of channel
ru_ru: Состояние канала

# ChannelQueue
source: Queue of channel
ru_ru: Очередь канала

# Removed
source: was removed
ru_ru: был удален

# Changed
source: was changed
ru_ru: был изменен

source: to
ru_ru: на

source: from
ru_ru: вместо

source: new
ru_ru: новый

# Added
source: was added
ru_ru: был добавлен

source: Channel state
ru_ru: Состояние канала

# ChannelsChanged
source: There are some changes in channels with names
ru_ru: Произошли некоторые изменения в каналах с названиями
