Repository: QuantumArt/QA.DPC
Catalog: QA.Core.DPC.Resources/ControlStrings.*.resx
Languages: ru_ru

source: Field Id
ru_ru: Id поля

source: Field Name
ru_ru: Имя поля

source: Field Name for Card
ru_ru: Имя поля для карточки

source: Publish Behaviour
ru_ru: Поведение при публикации

source: Cloning Mode
ru_ru: При клонировании родительской сущности

source: Updating Mode
ru_ru: При создании или обновлении

source: Deleting Mode
ru_ru: При удалении родительской сущности или удалении связи

source: Default Cache Period
ru_ru: Период кеширования по умолчанию

source: Enabled
ru_ru: Включено

source: Task Id
ru_ru: ID задачи

# IsReadOnly
source: Read-only
ru_ru: Только для чтения

source: Load all plain fields
ru_ru: Грузить все простые поля

source: Content Name
ru_ru: Имя контента

# InDefinition
source: Include in definition
ru_ru: Включить в описание

source: Description
ru_ru: Описание

source: Created date
ru_ru: Дата создания

source: Last status change time
ru_ru: Последнаяя смена статуса

source: Key
ru_ru: Ключ

source: Display Name
ru_ru: Имя

source: State
ru_ru: Статус

source: User Name
ru_ru: Заказчик

source: Message
ru_ru: Сообщение

source: Progress
ru_ru: Процент выполнения

source: Preloading Mode
ru_ru: Режим предзагрузки

source: Relation Condition
ru_ru: Условие на связь

source: Clone Prototype Condition
ru_ru: Условие клонирования прототипа

# RelationConditionDescription
source: SQL-statement for article list filtration
ru_ru: SQL-условие фильтрации списка статей

# ClonePrototypeConditionDescription
source: SQL-statement to specify prototype article for cloning
ru_ru: SQL-условие выбора статьи-прообраза для клонирования

# RelateToAnother
source: Relates to content
ru_ru: Ссылается на контент

# RelateToThis
source: Relates to this content from content
ru_ru: Ссылается на данный контент из контента

# IgnoreLoading
source: don't load
ru_ru: не загружать

source: eager loading
ru_ru: загружать сразу

source: lazy loading
ru_ru: загружать отложенно

source: publish
ru_ru: публиковать

source: don't publish
ru_ru: не публиковать

source: ignore
ru_ru: игнорировать

source: update or create
ru_ru: обновлять/создавать

source: don't remove
ru_ru: не удалять

source: remove
ru_ru: удалять

# SetNull
source: set null reference
ru_ru: устанавливать пустую ссылку

# UseExisting
source: use existing reference
ru_ru: использовать ссылку на оригинал

# Clone
source: clone entity
ru_ru: копировать сущность

source: Product Id List to Publish
ru_ru: Список ID продуктов, которые следует опубликовать перед отправкой

source: Product Id List
ru_ru: Список ID продуктов

# PartialSend
source: Send Products to all fronts (live and stage)
ru_ru: Отправка продуктов на все витрины (live и stage)

# PartialSendDescription
source: This utility allows publishing and sending product to fronts along with deleting archived, invisible or ocassionally deleted products.\nYou should enter list of regional or marketing product Ids (possible separators: <span class="highlighted">,</span>&nbsp;&nbsp;<span class="highlighted">;</span>&nbsp;&nbsp;<span class="highlighted">space</span>&nbsp;&nbsp;<span class="highlighted">newline</span>)
ru_ru: Данная утилита позволяет публиковать и отправлять продукты на витрины, а также удалять с витрин архивные, невидимые или по ошибке не удаленные продукты. В поле следует вводить список Id региональных продуктов (возможные разделители: <span class="highlighted">,</span>&nbsp;&nbsp;<span class="highlighted">;</span>&nbsp;&nbsp;<span class="highlighted">пробел</span>&nbsp;&nbsp;<span class="highlighted">новая строчка</span>)

source: Send Products
ru_ru: Отправить продукты

source: Publish and Send
ru_ru: Публиковать и отправить

source: Apply
ru_ru: Применить

source: Save
ru_ru: Сохранить

source: Process special statuses
ru_ru: Обрабатывать статьи со специальными статусами

source: Send on Stage only
ru_ru: Отправлять только на stage без публикации

# CurrentPartialSendTask
source: Current send task
ru_ru: Текущая задача на частичную отправку

# OnlyOneTask
source: Ð¡oncurrent execution of send tasks is prohibited. Please, wait for completion of the current task.
ru_ru: Одновременно может выполняться только одна задача на отправку. Дождитесь завершения данной.

# PublicationRequired
source: Some products are required to be published before send to fronts
ru_ru: Часть продуктов требует публикации перед отправкой на витрины

# ClickPublishAndSendButton
source: To publish these products please click "Publish and Send" button
ru_ru: Чтобы опубликовать эти продукты, нажмите кнопку "Публиковать и отправить"

source: JSON Field Name
ru_ru: Имя поля в JSON

# LabelText
source: Text in <label>
ru_ru: Текст в <label>

# IsClassifier
source: Classifier
ru_ru: Поле является классификатором

source: Path
ru_ru: Путь

# RemovePath
source: Path to remove field (specify only if it differs from Path)
ru_ru: Путь по которому надо удалить поле (имеет смысл только если отличается от значения в поле Путь)

source: Converter
ru_ru: Конвертер

source: Don't wrap in CDATA
ru_ru: Не оборачивать в CDATA

source: Load as Image
ru_ru: Загружать как поле типа Image

source: Cache Settings
ru_ru: Настройки кеширования

# AlreadyCached
source: Content is already cached as dictionary
ru_ru: Настройки кеширования

# ProceedCaching
source: Cache
ru_ru: Кешировать

source: Dictionary caching settings
ru_ru: Настройки кеширования словарей

# MissingInQp
source: Field is missing in QP
ru_ru: Поля не существует в QP!

source: Edit XML
ru_ru: Править XML

# EndEditXml
source: Finish XML Editing
ru_ru: Завершить правку XML

# Seconds
source: s
ru_ru: сек

source: Back to editing
ru_ru: Обратно к редактированию

source: Close
ru_ru: Закрыть

source: Exit
ru_ru: Выйти

source: Exit anyway
ru_ru: Выйти всё равно

source: Hide log
ru_ru: Спрятать лог

source: Not in definition
ru_ru: Нет в описании

source: Query on click
ru_ru: Поисковая строка по клику

source: Refresh
ru_ru: Обновить

# SameDefinition
source: Definition is the same. No changes to apply.
ru_ru: В описании нет изменений.

source: Save and exit
ru_ru: Сохранить и выйти

source: Show log
ru_ru: Показать лог

source: Wrap lines
ru_ru: Перенос строк

# UnsavedChanges
source: Your changes will not save. Are you sure that you want to leave?
ru_ru: Внесенные изменения не сохранятся. Вы уверены, что хотите выйти?

# FormLoadError
source: Form loading error
ru_ru: Ошибка загрузки формы

# FormSaveError
source: Form saving error
ru_ru: Ошибка сохранения формы

# SameForm
source: The form wasn't changed
ru_ru: Форма не была изменена
